# HasLeader Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..HasLeader Property
SpatialElementTag Class See Also
---
Identifies if a leader is displayed for the tag or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasLeader { get; set; }
```

Visual Basic
---
```text
Public Property HasLeader As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if a leader is displayed, otherwise false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: SpatialElementTag is orphaned. -or- When setting this property: Thrown when attempting to turn off leader of the pinned tag when the tag's head position is located outside off the host element. |

# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace